app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "hg"]]
---
  def create
    binding.pry
  	user = User.find_by(email: params[:login][:email] )