app/controllers/users_controller.rb

	def create
		# binding.pry
		@user=User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("firstname", "lastname", "username", "email", "phone", "password_digest", "attachment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

	def update
		# binding.pry
		@user =User.find(params[:id])
		if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "firstname" = $1, "lastname" = $2, "username" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["firstname", "venkat"], ["lastname", "sd"], ["username", "v645ddd"], ["updated_at", "2016-11-17 03:59:31.983757"], ["id", 1]]

	def destroy
		# binding.pry
		@user = User.find(current_user.id)
		@user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]